run/simpleBattery_copy/data/BextSidewalls1.0/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.59e-07; // Bi
    rho             rho [ 1 -3 0 0 0 0 0 ] 9800;
    conductivity    conductivity [-1 -3 3 0 0 2 0] 768000;//Fedor
}

phase2
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06; // electrolyte
    rho             rho [ 1 -3 0 0 0 0 0 ] 2690;
    conductivity    conductivity [-1 -3 3 0 0 2 0] 288;//Fedor
}

//nu              1.48e-05; rho             1;
sigma            sigma [ 1 0 -2 0 0 0 0 ] 0.39; //surface tension

curvatureModel
{
    type interpolationSmoothedCSFAlpha;
    nSmoothingIters 1;
}

// ************************************************************************* //
